MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33FJ128MC506A/mcu.h
/* C1FMSKSEL1 */
#define _F0MSK C1FMSKSEL1bits.F0MSK
#define _F1MSK C1FMSKSEL1bits.F1MSK
#define _F2MSK C1FMSKSEL1bits.F2MSK
#define _F3MSK C1FMSKSEL1bits.F3MSK
#define _F4MSK C1FMSKSEL1bits.F4MSK
#define _F5MSK C1FMSKSEL1bits.F5MSK
#define _F6MSK C1FMSKSEL1bits.F6MSK
#define _F7MSK C1FMSKSEL1bits.F7MSK
#define _F0MSK0 C1FMSKSEL1bits.F0MSK0
#define _F0MSK1 C1FMSKSEL1bits.F0MSK1
#define _F1MSK0 C1FMSKSEL1bits.F1MSK0
#define _F1MSK1 C1FMSKSEL1bits.F1MSK1
#define _F2MSK0 C1FMSKSEL1bits.F2MSK0
#define _F2MSK1 C1FMSKSEL1bits.F2MSK1
#define _F3MSK0 C1FMSKSEL1bits.F3MSK0
#define _F3MSK1 C1FMSKSEL1bits.F3MSK1
#define _F4MSK0 C1FMSKSEL1bits.F4MSK0
#define _F4MSK1 C1FMSKSEL1bits.F4MSK1
#define _F5MSK0 C1FMSKSEL1bits.F5MSK0
#define _F5MSK1 C1FMSKSEL1bits.F5MSK1
#define _F6MSK0 C1FMSKSEL1bits.F6MSK0
#define _F6MSK1 C1FMSKSEL1bits.F6MSK1
#define _F7MSK0 C1FMSKSEL1bits.F7MSK0
#define _F7MSK1 C1FMSKSEL1bits.F7MSK1

/* C1FMSKSEL2 */
#define _F8MSK C1FMSKSEL2bits.F8MSK
#define _F9MSK C1FMSKSEL2bits.F9MSK
#define _F10MSK C1FMSKSEL2bits.F10MSK
#define _F11MSK C1FMSKSEL2bits.F11MSK
#define _F12MSK C1FMSKSEL2bits.F12MSK
#define _F13MSK C1FMSKSEL2bits.F13MSK
#define _F14MSK C1FMSKSEL2bits.F14MSK
#define _F15MSK C1FMSKSEL2bits.F15MSK
#define _F8MSK0 C1FMSKSEL2bits.F8MSK0
#define _F8MSK1 C1FMSKSEL2bits.F8MSK1
#define _F9MSK0 C1FMSKSEL2bits.F9MSK0
#define _F9MSK1 C1FMSKSEL2bits.F9MSK1
#define _F10MSK0 C1FMSKSEL2bits.F10MSK0
#define _F10MSK1 C1FMSKSEL2bits.F10MSK1
#define _F11MSK0 C1FMSKSEL2bits.F11MSK0
#define _F11MSK1 C1FMSKSEL2bits.F11MSK1
#define _F12MSK0 C1FMSKSEL2bits.F12MSK0
#define _F12MSK1 C1FMSKSEL2bits.F12MSK1
#define _F13MSK0 C1FMSKSEL2bits.F13MSK0
#define _F13MSK1 C1FMSKSEL2bits.F13MSK1
#define _F14MSK0 C1FMSKSEL2bits.F14MSK0
#define _F14MSK1 C1FMSKSEL2bits.F14MSK1
#define _F15MSK0 C1FMSKSEL2bits.F15MSK0
#define _F15MSK1 C1FMSKSEL2bits.F15MSK1

/* C1BUFPNT1 */
/* Bitname _F0BP cannot be defined because it is used by more than one SFR */
/* Bitname _F1BP cannot be defined because it is used by more than one SFR */
/* Bitname _F2BP cannot be defined because it is used by more than one SFR */
/* Bitname _F3BP cannot be defined because it is used by more than one SFR */
#define _F0BP0 C1BUFPNT1bits.F0BP0
#define _F0BP1 C1BUFPNT1bits.F0BP1
#define _F0BP2 C1BUFPNT1bits.F0BP2
#define _F0BP3 C1BUFPNT1bits.F0BP3
#define _F1BP0 C1BUFPNT1bits.F1BP0
#define _F1BP1 C1BUFPNT1bits.F1BP1
#define _F1BP2 C1BUFPNT1bits.F1BP2
#define _F1BP3 C1BUFPNT1bits.F1BP3
#define _F2BP0 C1BUFPNT1bits.F2BP0
#define _F2BP1 C1BUFPNT1bits.F2BP1
#define _F2BP2 C1BUFPNT1bits.F2BP2
#define _F2BP3 C1BUFPNT1bits.F2BP3
#define _F3BP0 C1BUFPNT1bits.F3BP0
#define _F3BP1 C1BUFPNT1bits.F3BP1
#define _F3BP2 C1BUFPNT1bits.F3BP2
#define _F3BP3 C1BUFPNT1bits.F3BP3

/* C1RXFUL1 */
/* Bitname _RXFUL0 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL1 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL2 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL3 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL4 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL5 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL6 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL7 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL8 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL9 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL10 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL11 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL12 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL13 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL14 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL15 cannot be defined because it is used by more than one SFR */

/* C1BUFPNT2 */
/* Bitname _F4BP cannot be defined because it is used by more than one SFR */
/* Bitname _F5BP cannot be defined because it is used by more than one SFR */
/* Bitname _F6BP cannot be defined because it is used by more than one SFR */
/* Bitname _F7BP cannot be defined because it is used by more than one SFR */
#define _F4BP0 C1BUFPNT2bits.F4BP0
#define _F4BP1 C1BUFPNT2bits.F4BP1
#define _F4BP2 C1BUFPNT2bits.F4BP2
#define _F4BP3 C1BUFPNT2bits.F4BP3
#define _F5BP0 C1BUFPNT2bits.F5BP0
#define _F5BP1 C1BUFPNT2bits.F5BP1
#define _F5BP2 C1BUFPNT2bits.F5BP2
#define _F5BP3 C1BUFPNT2bits.F5BP3
#define _F6BP0 C1BUFPNT2bits.F6BP0
#define _F6BP1 C1BUFPNT2bits.F6BP1
#define _F6BP2 C1BUFPNT2bits.F6BP2
#define _F6BP3 C1BUFPNT2bits.F6BP3
#define _F7BP0 C1BUFPNT2bits.F7BP0
#define _F7BP1 C1BUFPNT2bits.F7BP1
#define _F7BP2 C1BUFPNT2bits.F7BP2
#define _F7BP3 C1BUFPNT2bits.F7BP3

/* C1RXFUL2 */
/* Bitname _RXFUL16 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL17 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL18 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL19 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL20 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL21 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL22 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL23 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL24 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL25 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL26 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL27 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL28 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL29 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL30 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL31 cannot be defined because it is used by more than one SFR */

/* C1BUFPNT3 */
#define _F8BP C1BUFPNT3bits.F8BP
#define _F9BP C1BUFPNT3bits.F9BP
#define _F10BP C1BUFPNT3bits.F10BP
#define _F11BP C1BUFPNT3bits.F11BP
#define _F8BP0 C1BUFPNT3bits.F8BP0
#define _F8BP1 C1BUFPNT3bits.F8BP1
#define _F8BP2 C1BUFPNT3bits.F8BP2
#define _F8BP3 C1BUFPNT3bits.F8BP3
#define _F9BP0 C1BUFPNT3bits.F9BP0
#define _F9BP1 C1BUFPNT3bits.F9BP1
#define _F9BP2 C1BUFPNT3bits.F9BP2
#define _F9BP3 C1BUFPNT3bits.F9BP3
#define _F10BP0 C1BUFPNT3bits.F10BP0
#define _F10BP1 C1BUFPNT3bits.F10BP1
#define _F10BP2 C1BUFPNT3bits.F10BP2
#define _F10BP3 C1BUFPNT3bits.F10BP3
#define _F11BP0 C1BUFPNT3bits.F11BP0
#define _F11BP1 C1BUFPNT3bits.F11BP1
#define _F11BP2 C1BUFPNT3bits.F11BP2
#define _F11BP3 C1BUFPNT3bits.F11BP3

/* C1BUFPNT4 */
#define _F12BP C1BUFPNT4bits.F12BP
#define _F13BP C1BUFPNT4bits.F13BP
#define _F14BP C1BUFPNT4bits.F14BP
#define _F15BP C1BUFPNT4bits.F15BP
#define _F12BP0 C1BUFPNT4bits.F12BP0
#define _F12BP1 C1BUFPNT4bits.F12BP1
#define _F12BP2 C1BUFPNT4bits.F12BP2
#define _F12BP3 C1BUFPNT4bits.F12BP3
#define _F13BP0 C1BUFPNT4bits.F13BP0
#define _F13BP1 C1BUFPNT4bits.F13BP1
#define _F13BP2 C1BUFPNT4bits.F13BP2
#define _F13BP3 C1BUFPNT4bits.F13BP3
#define _F14BP0 C1BUFPNT4bits.F14BP0
#define _F14BP1 C1BUFPNT4bits.F14BP1
#define _F14BP2 C1BUFPNT4bits.F14BP2
#define _F14BP3 C1BUFPNT4bits.F14BP3
#define _F15BP0 C1BUFPNT4bits.F15BP0
#define _F15BP1 C1BUFPNT4bits.F15BP1
#define _F15BP2 C1BUFPNT4bits.F15BP2
#define _F15BP3 C1BUFPNT4bits.F15BP3

/* C1RXOVF1 */
#define _RXOVF0 C1RXOVF1bits.RXOVF0
#define _RXOVF1 C1RXOVF1bits.RXOVF1
#define _RXOVF2 C1RXOVF1bits.RXOVF2
#define _RXOVF3 C1RXOVF1bits.RXOVF3
#define _RXOVF4 C1RXOVF1bits.RXOVF4
#define _RXOVF5 C1RXOVF1bits.RXOVF5
#define _RXOVF6 C1RXOVF1bits.RXOVF6
#define _RXOVF7 C1RXOVF1bits.RXOVF7
#define _RXOVF8 C1RXOVF1bits.RXOVF8
#define _RXOVF9 C1RXOVF1bits.RXOVF9
#define _RXOVF10 C1RXOVF1bits.RXOVF10
#define _RXOVF11 C1RXOVF1bits.RXOVF11
#define _RXOVF12 C1RXOVF1bits.RXOVF12
#define _RXOVF13 C1RXOVF1bits.RXOVF13
#define _RXOVF14 C1RXOVF1bits.RXOVF14
#define _RXOVF15 C1RXOVF1bits.RXOVF15

/* C1RXOVF2 */
#define _RXOVF16 C1RXOVF2bits.RXOVF16
#define _RXOVF17 C1RXOVF2bits.RXOVF17
#define _RXOVF18 C1RXOVF2bits.RXOVF18
#define _RXOVF19 C1RXOVF2bits.RXOVF19
#define _RXOVF20 C1RXOVF2bits.RXOVF20
#define _RXOVF21 C1RXOVF2bits.RXOVF21
#define _RXOVF22 C1RXOVF2bits.RXOVF22
#define _RXOVF23 C1RXOVF2bits.RXOVF23
#define _RXOVF24 C1RXOVF2bits.RXOVF24
#define _RXOVF25 C1RXOVF2bits.RXOVF25
#define _RXOVF26 C1RXOVF2bits.RXOVF26
#define _RXOVF27 C1RXOVF2bits.RXOVF27
#define _RXOVF28 C1RXOVF2bits.RXOVF28
#define _RXOVF29 C1RXOVF2bits.RXOVF29
#define _RXOVF30 C1RXOVF2bits.RXOVF30
#define _RXOVF31 C1RXOVF2bits.RXOVF31

/* C1RXM0SID */
/* Bitname _EID16 cannot be defined because it is used by more than one SFR */
/* Bitname _EID17 cannot be defined because it is used by more than one SFR */
/* Bitname _MIDE cannot be defined because it is used by more than one SFR */
/* Bitname _SID0 cannot be defined because it is used by more than one SFR */
/* Bitname _SID1 cannot be defined because it is used by more than one SFR */
/* Bitname _SID2 cannot be defined because it is used by more than one SFR */
/* Bitname _SID3 cannot be defined because it is used by more than one SFR */
/* Bitname _SID4 cannot be defined because it is used by more than one SFR */
/* Bitname _SID5 cannot be defined because it is used by more than one SFR */
/* Bitname _SID6 cannot be defined because it is used by more than one SFR */
/* Bitname _SID7 cannot be defined because it is used by more than one SFR */
/* Bitname _SID8 cannot be defined because it is used by more than one SFR */
/* Bitname _SID9 cannot be defined because it is used by more than one SFR */
/* Bitname _SID10 cannot be defined because it is used by more than one SFR */
/* Bitname _EID cannot be defined because it is used by more than one SFR */
/* Bitname _SID cannot be defined because it is used by more than one SFR */

/* C1TR01CON */
/* Bitname _TX0PRI cannot be defined because it is used by more than one SFR */
/* Bitname _RTREN0 cannot be defined because it is used by more than one SFR */
/* Bitname _TXREQ0 cannot be defined because it is used by more than one SFR */
/* Bitname _TXERR0 cannot be defined because it is used by more than one SFR */
/* Bitname _TXLARB0 cannot be defined because it is used by more than one SFR */
/* Bitname _TXABT0 cannot be defined because it is used by more than one SFR */
/* Bitname _TXEN0 cannot be defined because it is used by more than one SFR */
/* Bitname _TX1PRI cannot be defined because it is used by more than one SFR */
/* Bitname _RTREN1 cannot be defined because it is used by more than one SFR */
/* Bitname _TXREQ1 cannot be defined because it is used by more than one SFR */
/* Bitname _TXERR1 cannot be defined because it is used by more than one SFR */
/* Bitname _TXLARB1 cannot be defined because it is used by more than one SFR */
/* Bitname _TXABT1 cannot be defined because it is used by more than one SFR */
/* Bitname _TXEN1 cannot be defined because it is used by more than one SFR */
/* Bitname _TX0PRI0 cannot be defined because it is used by more than one SFR */
/* Bitname _TX0PRI1 cannot be defined because it is used by more than one SFR */
/* Bitname _TX1PRI0 cannot be defined because it is used by more than one SFR */
/* Bitname _TX1PRI1 cannot be defined because it is used by more than one SFR */

/* C1RXM0EID */
/* Bitname _EID0 cannot be defined because it is used by more than one SFR */
/* Bitname _EID1 cannot be defined because it is used by more than one SFR */
/* Bitname _EID2 cannot be defined because it is used by more than one SFR */
/* Bitname _EID3 cannot be defined because it is used by more than one SFR */
/* Bitname _EID4 cannot be defined because it is used by more than one SFR */
/* Bitname _EID5 cannot be defined because it is used by more than one SFR */
/* Bitname _EID6 cannot be defined because it is used by more than one SFR */
/* Bitname _EID7 cannot be defined because it is used by more than one SFR */
/* Bitname _EID8 cannot be defined because it is used by more than one SFR */
/* Bitname _EID9 cannot be defined because it is used by more than one SFR */
/* Bitname _EID10 cannot be defined because it is used by more than one SFR */
/* Bitname _EID11 cannot be defined because it is used by more than one SFR */
/* Bitname _EID12 cannot be defined because it is used by more than one SFR */
/* Bitname _EID13 cannot be defined because it is used by more than one SFR */
/* Bitname _EID14 cannot be defined because it is used by more than one SFR */
/* Bitname _EID15 cannot be defined because it is used by more than one SFR */
/* Bitname _EID cannot be defined because it is used by more than one SFR */

/* C1TR23CON */
/* Bitname _TX2PRI cannot be defined because it is used by more than one SFR */
/* Bitname _RTREN2 cannot be defined because it is used by more than one SFR */
/* Bitname _TXREQ2 cannot be defined because it is used by more than one SFR */
/* Bitname _TXERR2 cannot be defined because it is used by more than one SFR */
/* Bitname _TXLARB2 cannot be defined because it is used by more than one SFR */
/* Bitname _TXABT2 cannot be defined because it is used by more than one SFR */
/* Bitname _TXEN2 cannot be defined because it is used by more than one SFR */
/* Bitname _TX3PRI cannot be defined because it is used by more than one SFR */
/* Bitname _RTREN3 cannot be defined because it is used by more than one SFR */
/* Bitname _TXREQ3 cannot be defined because it is used by more than one SFR */
/* Bitname _TXERR3 cannot be defined because it is used by more than one SFR */
/* Bitname _TXLARB3 cannot be defined because it is used by more than one SFR */
/* Bitname _TXABT3 cannot be defined because it is used by more than one SFR */
/* Bitname _TXEN3 cannot be defined because it is used by more than one SFR */
/* Bitname _TX2PRI0 cannot be defined because it is used by more than one SFR */
/* Bitname _TX2PRI1 cannot be defined because it is used by more than one SFR */
/* Bitname _TX3PRI0 cannot be defined because it is used by more than one SFR */
/* Bitname _TX3PRI1 cannot be defined because it is used by more than one SFR */

/* C1RXM1SID */
/* Bitname _EID16 cannot be defined because it is used by more than one SFR */
/* Bitname _EID17 cannot be defined because it is used by more than one SFR */
/* Bitname _MIDE cannot be defined because it is used by more than one SFR */
/* Bitname _SID0 cannot be defined because it is used by more than one SFR */
/* Bitname _SID1 cannot be defined because it is used by more than one SFR */
/* Bitname _SID2 cannot be defined because it is used by more than one SFR */
/* Bitname _SID3 cannot be defined because it is used by more than one SFR */
/* Bitname _SID4 cannot be defined because it is used by more than one SFR */
/* Bitname _SID5 cannot be defined because it is used by more than one SFR */
/* Bitname _SID6 cannot be defined because it is used by more than one SFR */
/* Bitname _SID7 cannot be defined because it is used by more than one SFR */
/* Bitname _SID8 cannot be defined because it is used by more than one SFR */
/* Bitname _SID9 cannot be defined because it is used by more than one SFR */
/* Bitname _SID10 cannot be defined because it is used by more than one SFR */
/* Bitname _EID cannot be defined because it is used by more than one SFR */
/* Bitname _SID cannot be defined because it is used by more than one SFR */

/* C1TR45CON */
/* Bitname _TX4PRI cannot be defined because it is used by more than one SFR */
/* Bitname _RTREN4 cannot be defined because it is used by more than one SFR */
/* Bitname _TXREQ4 cannot be defined because it is used by more than one SFR */
/* Bitname _TXERR4 cannot be defined because it is used by more than one SFR */
/* Bitname _TXLARB4 cannot be defined because it is used by more than one SFR */
/* Bitname _TXABT4 cannot be defined because it is used by more than one SFR */
/* Bitname _TXEN4 cannot be defined because it is used by more than one SFR */
/* Bitname _TX5PRI cannot be defined because it is used by more than one SFR */
/* Bitname _RTREN5 cannot be defined because it is used by more than one SFR */
/* Bitname _TXREQ5 cannot be defined because it is used by more than one SFR */
/* Bitname _TXERR5 cannot be defined because it is used by more than one SFR */
/* Bitname _TXLARB5 cannot be defined because it is used by more than one SFR */
/* Bitname _TXABT5 cannot be defined because it is used by more than one SFR */
/* Bitname _TXEN5 cannot be defined because it is used by more than one SFR */
/* Bitname _TX4PRI0 cannot be defined because it is used by more than one SFR */
/* Bitname _TX4PRI1 cannot be defined because it is used by more than one SFR */
/* Bitname _TX5PRI0 cannot be defined because it is used by more than one SFR */
/* Bitname _TX5PRI1 cannot be defined because it is used by more than one SFR */

/* C1RXM1EID */
/* Bitname _EID0 cannot be defined because it is used by more than one SFR */
/* Bitname _EID1 cannot be defined because it is used by more than one SFR */
/* Bitname _EID2 cannot be defined because it is used by more than one SFR */
/* Bitname _EID3 cannot be defined because it is used by more than one SFR */
/* Bitname _EID4 cannot be defined because it is used by more than one SFR */
/* Bitname _EID5 cannot be defined because it is used by more than one SFR */
/* Bitname _EID6 cannot be defined because it is used by more than one SFR */
/* Bitname _EID7 cannot be defined because it is used by more than one SFR */
/* Bitname _EID8 cannot be defined because it is used by more than one SFR */
/* Bitname _EID9 cannot be defined because it is used by more than one SFR */
/* Bitname _EID10 cannot be defined because it is used by more than one SFR */
/* Bitname _EID11 cannot be defined because it is used by more than one SFR */
/* Bitname _EID12 cannot be defined because it is used by more than one SFR */
/* Bitname _EID13 cannot be defined because it is used by more than one SFR */
/* Bitname _EID14 cannot be defined because it is used by more than one SFR */
/* Bitname _EID15 cannot be defined because it is used by more than one SFR */
/* Bitname _EID cannot be defined because it is used by more than one SFR */

/* C1TR67CON */
/* Bitname _TX6PRI cannot be defined because it is used by more than one SFR */
/* Bitname _RTREN6 cannot be defined because it is used by more than one SFR */
/* Bitname _TXREQ6 cannot be defined because it is used by more than one SFR */
/* Bitname _TXERR6 cannot be defined because it is used by more than one SFR */
/* Bitname _TXLARB6 cannot be defined because it is used by more than one SFR */
/* Bitname _TXABT6 cannot be defined because it is used by more than one SFR */
/* Bitname _TXEN6 cannot be defined because it is used by more than one SFR */
/* Bitname _TX7PRI cannot be defined because it is used by more than one SFR */
/* Bitname _RTREN7 cannot be defined because it is used by more than one SFR */
/* Bitname _TXREQ7 cannot be defined because it is used by more than one SFR */
/* Bitname _TXERR7 cannot be defined because it is used by more than one SFR */
/* Bitname _TXLARB7 cannot be defined because it is used by more than one SFR */
/* Bitname _TXABT7 cannot be defined because it is used by more than one SFR */
/* Bitname _TXEN7 cannot be defined because it is used by more than one SFR */
/* Bitname _TX6PRI0 cannot be defined because it is used by more than one SFR */
/* Bitname _TX6PRI1 cannot be defined because it is used by more than one SFR */
/* Bitname _TX7PRI0 cannot be defined because it is used by more than one SFR */
/* Bitname _TX7PRI1 cannot be defined because it is used by more than one SFR */

