MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33FJ128MC506A/mcu.h
#define _C1RXF15EID_EID12_POSITION               0x0000000C
#define _C1RXF15EID_EID12_MASK                   0x00001000
#define _C1RXF15EID_EID12_LENGTH                 0x00000001

#define _C1RXF15EID_EID13_POSITION               0x0000000D
#define _C1RXF15EID_EID13_MASK                   0x00002000
#define _C1RXF15EID_EID13_LENGTH                 0x00000001

#define _C1RXF15EID_EID14_POSITION               0x0000000E
#define _C1RXF15EID_EID14_MASK                   0x00004000
#define _C1RXF15EID_EID14_LENGTH                 0x00000001

#define _C1RXF15EID_EID15_POSITION               0x0000000F
#define _C1RXF15EID_EID15_MASK                   0x00008000
#define _C1RXF15EID_EID15_LENGTH                 0x00000001

#define _C1RXF15EID_EID_POSITION                 0x00000000
#define _C1RXF15EID_EID_MASK                     0x0000FFFF
#define _C1RXF15EID_EID_LENGTH                   0x00000010

#define _C2BUFPNT1_F0BP_POSITION                 0x00000000
#define _C2BUFPNT1_F0BP_MASK                     0x0000000F
#define _C2BUFPNT1_F0BP_LENGTH                   0x00000004

#define _C2BUFPNT1_F1BP_POSITION                 0x00000004
#define _C2BUFPNT1_F1BP_MASK                     0x000000F0
#define _C2BUFPNT1_F1BP_LENGTH                   0x00000004

#define _C2BUFPNT1_F2BP_POSITION                 0x00000008
#define _C2BUFPNT1_F2BP_MASK                     0x00000F00
#define _C2BUFPNT1_F2BP_LENGTH                   0x00000004

#define _C2BUFPNT1_F3BP_POSITION                 0x0000000C
#define _C2BUFPNT1_F3BP_MASK                     0x0000F000
#define _C2BUFPNT1_F3BP_LENGTH                   0x00000004

#define _C2RXFUL1_RXFUL0_POSITION                0x00000000
#define _C2RXFUL1_RXFUL0_MASK                    0x00000001
#define _C2RXFUL1_RXFUL0_LENGTH                  0x00000001

#define _C2RXFUL1_RXFUL1_POSITION                0x00000001
#define _C2RXFUL1_RXFUL1_MASK                    0x00000002
#define _C2RXFUL1_RXFUL1_LENGTH                  0x00000001

#define _C2RXFUL1_RXFUL2_POSITION                0x00000002
#define _C2RXFUL1_RXFUL2_MASK                    0x00000004
#define _C2RXFUL1_RXFUL2_LENGTH                  0x00000001

#define _C2RXFUL1_RXFUL3_POSITION                0x00000003
#define _C2RXFUL1_RXFUL3_MASK                    0x00000008
#define _C2RXFUL1_RXFUL3_LENGTH                  0x00000001

#define _C2RXFUL1_RXFUL4_POSITION                0x00000004
#define _C2RXFUL1_RXFUL4_MASK                    0x00000010
#define _C2RXFUL1_RXFUL4_LENGTH                  0x00000001

#define _C2RXFUL1_RXFUL5_POSITION                0x00000005
#define _C2RXFUL1_RXFUL5_MASK                    0x00000020
#define _C2RXFUL1_RXFUL5_LENGTH                  0x00000001

#define _C2RXFUL1_RXFUL6_POSITION                0x00000006
#define _C2RXFUL1_RXFUL6_MASK                    0x00000040
#define _C2RXFUL1_RXFUL6_LENGTH                  0x00000001

#define _C2RXFUL1_RXFUL7_POSITION                0x00000007
#define _C2RXFUL1_RXFUL7_MASK                    0x00000080
#define _C2RXFUL1_RXFUL7_LENGTH                  0x00000001

#define _C2RXFUL1_RXFUL8_POSITION                0x00000008
#define _C2RXFUL1_RXFUL8_MASK                    0x00000100
#define _C2RXFUL1_RXFUL8_LENGTH                  0x00000001

#define _C2RXFUL1_RXFUL9_POSITION                0x00000009
#define _C2RXFUL1_RXFUL9_MASK                    0x00000200
#define _C2RXFUL1_RXFUL9_LENGTH                  0x00000001

#define _C2RXFUL1_RXFUL10_POSITION               0x0000000A
#define _C2RXFUL1_RXFUL10_MASK                   0x00000400
#define _C2RXFUL1_RXFUL10_LENGTH                 0x00000001

#define _C2RXFUL1_RXFUL11_POSITION               0x0000000B
#define _C2RXFUL1_RXFUL11_MASK                   0x00000800
#define _C2RXFUL1_RXFUL11_LENGTH                 0x00000001

#define _C2RXFUL1_RXFUL12_POSITION               0x0000000C
#define _C2RXFUL1_RXFUL12_MASK                   0x00001000
#define _C2RXFUL1_RXFUL12_LENGTH                 0x00000001

#define _C2RXFUL1_RXFUL13_POSITION               0x0000000D
#define _C2RXFUL1_RXFUL13_MASK                   0x00002000
#define _C2RXFUL1_RXFUL13_LENGTH                 0x00000001

#define _C2RXFUL1_RXFUL14_POSITION               0x0000000E
#define _C2RXFUL1_RXFUL14_MASK                   0x00004000
#define _C2RXFUL1_RXFUL14_LENGTH                 0x00000001

#define _C2RXFUL1_RXFUL15_POSITION               0x0000000F
#define _C2RXFUL1_RXFUL15_MASK                   0x00008000
#define _C2RXFUL1_RXFUL15_LENGTH                 0x00000001

#define _C2BUFPNT2_F4BP_POSITION                 0x00000000
#define _C2BUFPNT2_F4BP_MASK                     0x0000000F
#define _C2BUFPNT2_F4BP_LENGTH                   0x00000004

#define _C2BUFPNT2_F5BP_POSITION                 0x00000004
#define _C2BUFPNT2_F5BP_MASK                     0x000000F0
#define _C2BUFPNT2_F5BP_LENGTH                   0x00000004

#define _C2BUFPNT2_F6BP_POSITION                 0x00000008
#define _C2BUFPNT2_F6BP_MASK                     0x00000F00
#define _C2BUFPNT2_F6BP_LENGTH                   0x00000004

#define _C2BUFPNT2_F7BP_POSITION                 0x0000000C
#define _C2BUFPNT2_F7BP_MASK                     0x0000F000
#define _C2BUFPNT2_F7BP_LENGTH                   0x00000004

#define _C2RXFUL2_RXFUL16_POSITION               0x00000000
#define _C2RXFUL2_RXFUL16_MASK                   0x00000001
#define _C2RXFUL2_RXFUL16_LENGTH                 0x00000001

#define _C2RXFUL2_RXFUL17_POSITION               0x00000001
#define _C2RXFUL2_RXFUL17_MASK                   0x00000002
#define _C2RXFUL2_RXFUL17_LENGTH                 0x00000001

#define _C2RXFUL2_RXFUL18_POSITION               0x00000002
#define _C2RXFUL2_RXFUL18_MASK                   0x00000004
#define _C2RXFUL2_RXFUL18_LENGTH                 0x00000001

#define _C2RXFUL2_RXFUL19_POSITION               0x00000003
#define _C2RXFUL2_RXFUL19_MASK                   0x00000008
#define _C2RXFUL2_RXFUL19_LENGTH                 0x00000001

#define _C2RXFUL2_RXFUL20_POSITION               0x00000004
#define _C2RXFUL2_RXFUL20_MASK                   0x00000010
#define _C2RXFUL2_RXFUL20_LENGTH                 0x00000001

#define _C2RXFUL2_RXFUL21_POSITION               0x00000005
#define _C2RXFUL2_RXFUL21_MASK                   0x00000020
#define _C2RXFUL2_RXFUL21_LENGTH                 0x00000001

