MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33FJ128MC506A/mcu.h
#define _C2RXF0SID_SID2_POSITION                 0x00000007
#define _C2RXF0SID_SID2_MASK                     0x00000080
#define _C2RXF0SID_SID2_LENGTH                   0x00000001

#define _C2RXF0SID_SID3_POSITION                 0x00000008
#define _C2RXF0SID_SID3_MASK                     0x00000100
#define _C2RXF0SID_SID3_LENGTH                   0x00000001

#define _C2RXF0SID_SID4_POSITION                 0x00000009
#define _C2RXF0SID_SID4_MASK                     0x00000200
#define _C2RXF0SID_SID4_LENGTH                   0x00000001

#define _C2RXF0SID_SID5_POSITION                 0x0000000A
#define _C2RXF0SID_SID5_MASK                     0x00000400
#define _C2RXF0SID_SID5_LENGTH                   0x00000001

#define _C2RXF0SID_SID6_POSITION                 0x0000000B
#define _C2RXF0SID_SID6_MASK                     0x00000800
#define _C2RXF0SID_SID6_LENGTH                   0x00000001

#define _C2RXF0SID_SID7_POSITION                 0x0000000C
#define _C2RXF0SID_SID7_MASK                     0x00001000
#define _C2RXF0SID_SID7_LENGTH                   0x00000001

#define _C2RXF0SID_SID8_POSITION                 0x0000000D
#define _C2RXF0SID_SID8_MASK                     0x00002000
#define _C2RXF0SID_SID8_LENGTH                   0x00000001

#define _C2RXF0SID_SID9_POSITION                 0x0000000E
#define _C2RXF0SID_SID9_MASK                     0x00004000
#define _C2RXF0SID_SID9_LENGTH                   0x00000001

#define _C2RXF0SID_SID10_POSITION                0x0000000F
#define _C2RXF0SID_SID10_MASK                    0x00008000
#define _C2RXF0SID_SID10_LENGTH                  0x00000001

#define _C2RXF0EID_EID0_POSITION                 0x00000000
#define _C2RXF0EID_EID0_MASK                     0x00000001
#define _C2RXF0EID_EID0_LENGTH                   0x00000001

#define _C2RXF0EID_EID1_POSITION                 0x00000001
#define _C2RXF0EID_EID1_MASK                     0x00000002
#define _C2RXF0EID_EID1_LENGTH                   0x00000001

#define _C2RXF0EID_EID2_POSITION                 0x00000002
#define _C2RXF0EID_EID2_MASK                     0x00000004
#define _C2RXF0EID_EID2_LENGTH                   0x00000001

#define _C2RXF0EID_EID3_POSITION                 0x00000003
#define _C2RXF0EID_EID3_MASK                     0x00000008
#define _C2RXF0EID_EID3_LENGTH                   0x00000001

#define _C2RXF0EID_EID4_POSITION                 0x00000004
#define _C2RXF0EID_EID4_MASK                     0x00000010
#define _C2RXF0EID_EID4_LENGTH                   0x00000001

#define _C2RXF0EID_EID5_POSITION                 0x00000005
#define _C2RXF0EID_EID5_MASK                     0x00000020
#define _C2RXF0EID_EID5_LENGTH                   0x00000001

#define _C2RXF0EID_EID6_POSITION                 0x00000006
#define _C2RXF0EID_EID6_MASK                     0x00000040
#define _C2RXF0EID_EID6_LENGTH                   0x00000001

#define _C2RXF0EID_EID7_POSITION                 0x00000007
#define _C2RXF0EID_EID7_MASK                     0x00000080
#define _C2RXF0EID_EID7_LENGTH                   0x00000001

#define _C2RXF0EID_EID8_POSITION                 0x00000008
#define _C2RXF0EID_EID8_MASK                     0x00000100
#define _C2RXF0EID_EID8_LENGTH                   0x00000001

#define _C2RXF0EID_EID9_POSITION                 0x00000009
#define _C2RXF0EID_EID9_MASK                     0x00000200
#define _C2RXF0EID_EID9_LENGTH                   0x00000001

#define _C2RXF0EID_EID10_POSITION                0x0000000A
#define _C2RXF0EID_EID10_MASK                    0x00000400
#define _C2RXF0EID_EID10_LENGTH                  0x00000001

#define _C2RXF0EID_EID11_POSITION                0x0000000B
#define _C2RXF0EID_EID11_MASK                    0x00000800
#define _C2RXF0EID_EID11_LENGTH                  0x00000001

#define _C2RXF0EID_EID12_POSITION                0x0000000C
#define _C2RXF0EID_EID12_MASK                    0x00001000
#define _C2RXF0EID_EID12_LENGTH                  0x00000001

#define _C2RXF0EID_EID13_POSITION                0x0000000D
#define _C2RXF0EID_EID13_MASK                    0x00002000
#define _C2RXF0EID_EID13_LENGTH                  0x00000001

#define _C2RXF0EID_EID14_POSITION                0x0000000E
#define _C2RXF0EID_EID14_MASK                    0x00004000
#define _C2RXF0EID_EID14_LENGTH                  0x00000001

#define _C2RXF0EID_EID15_POSITION                0x0000000F
#define _C2RXF0EID_EID15_MASK                    0x00008000
#define _C2RXF0EID_EID15_LENGTH                  0x00000001

#define _C2TXD_C2TXD_POSITION                    0x00000001
#define _C2TXD_C2TXD_MASK                        0x0000FFFE
#define _C2TXD_C2TXD_LENGTH                      0x0000000F

#define _ODCD_ODCD0_POSITION                     0x00000000
#define _ODCD_ODCD0_MASK                         0x00000001
#define _ODCD_ODCD0_LENGTH                       0x00000001

#define _ODCD_ODCD1_POSITION                     0x00000001
#define _ODCD_ODCD1_MASK                         0x00000002
#define _ODCD_ODCD1_LENGTH                       0x00000001

#define _ODCD_ODCD2_POSITION                     0x00000002
#define _ODCD_ODCD2_MASK                         0x00000004
#define _ODCD_ODCD2_LENGTH                       0x00000001

#define _ODCD_ODCD3_POSITION                     0x00000003
#define _ODCD_ODCD3_MASK                         0x00000008
#define _ODCD_ODCD3_LENGTH                       0x00000001

#define _ODCD_ODCD4_POSITION                     0x00000004
#define _ODCD_ODCD4_MASK                         0x00000010
#define _ODCD_ODCD4_LENGTH                       0x00000001

#define _ODCD_ODCD5_POSITION                     0x00000005
#define _ODCD_ODCD5_MASK                         0x00000020
#define _ODCD_ODCD5_LENGTH                       0x00000001

#define _ODCD_ODCD6_POSITION                     0x00000006
#define _ODCD_ODCD6_MASK                         0x00000040
#define _ODCD_ODCD6_LENGTH                       0x00000001

#define _ODCD_ODCD7_POSITION                     0x00000007
#define _ODCD_ODCD7_MASK                         0x00000080
#define _ODCD_ODCD7_LENGTH                       0x00000001

#define _ODCD_ODCD8_POSITION                     0x00000008
#define _ODCD_ODCD8_MASK                         0x00000100
#define _ODCD_ODCD8_LENGTH                       0x00000001

#define _ODCD_ODCD9_POSITION                     0x00000009
#define _ODCD_ODCD9_MASK                         0x00000200
#define _ODCD_ODCD9_LENGTH                       0x00000001

#define _ODCD_ODCD10_POSITION                    0x0000000A
#define _ODCD_ODCD10_MASK                        0x00000400
#define _ODCD_ODCD10_LENGTH                      0x00000001

